In [26]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [27]:
import numpy as np 
import os

import pandas as pd

### Q: What is a Pandas Series? Write down its key features.

- A Pandas Series is a one-dimensional labeled array capable of holding data of any type 
- (integer, string, float, python objects, etc.). It is similar to a column in a table.

### Q: 
1. Create a Pandas Series from a list `[10, 20, 30, 40]` and display its data type using `.dtype`.  
2. Create a Pandas Series from a dictionary: `{'a': 100, 'b': 200, 'c': 300}`. Display the Series.  
3. Create a Pandas Series using NumPy array: `np.array([1, 2, 3, 4])`. Assign custom indices `['x', 'y', 'z', 'w']`.

In [3]:
# 1. Series from a list
a = [10, 20, 30, 40]
b = pd.Series(a)
print(b)
print(b.dtype)

0    10
1    20
2    30
3    40
dtype: int64
int64

In [4]:
# 2. Series from a dictionary
d = {'a': 100, 'b': 200, 'c': 300}
e = pd.Series(d)
print(e)

a    100
b    200
c    300
dtype: int64

In [5]:
# 3. Series from NumPy array with custom indices
a = np.array([1, 2, 3, 4])
b = pd.Series(a, index=['x', 'y', 'z', 'w'])
print(b)

x    1
y    2
z    3
w    4
dtype: int64

### Q:
1. Create a Series `[5, 10, 15, 20]` and access the second element using `.iloc`.  
2. Use `.loc` to access the value corresponding to the label `'b'` in the Series created from `{'a': 50, 'b': 100, 'c': 150}`.

In [6]:
# 1. Series and access using .iloc
a = pd.Series([5, 10, 15, 20])
print(a)
print(a.iloc[1])

0     5
1    10
2    15
3    20
dtype: int64
10

In [7]:
# 2. Series from dictionary and access using .loc
d = pd.Series({'a': 50, 'b': 100, 'c': 150})
print(d)
print(d.loc['b'])

a     50
b    100
c    150
dtype: int64
100

### Q:
Create a Series `[1, 2, 3, 4, 5]`. Add `10` to each element and display the result.

In [8]:
# Create Series
a = pd.Series([1, 2, 3, 4, 5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
b = a + 10
print(b)

0    11
1    12
2    13
3    14
4    15
dtype: int64

### Q:
Create a Series `[10, 20, 30, 40, 50]`. Filter and display only the values greater than `25`.

In [10]:
a = pd.Series([10, 20, 30, 40, 50])
print(a)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
b = a[a > 25]
print(b)

2    30
3    40
4    50
dtype: int64

### Q:
1. Create a Series `[1, 2, None, 4, None]`. Use `.isna()` to identify missing values.  
2. Use `.notna()` to display only non-missing values.

In [12]:
a = pd.Series([1, 2, None, 4, None])
print(a)

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [13]:
print(a.isna())

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [14]:
print(a[a.notna()])

0    1.0
1    2.0
3    4.0
dtype: float64

### Q:
Create a Series `[2, 4, 6, 8, 10]`. Calculate the sum of all elements using `.sum()`.

In [15]:
a = pd.Series([2, 4, 6, 8, 10])
print(a)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [16]:
b = a.sum()
print(b)

30

### Q:
Create a Series `[10, 15, 20, 25]`. Use `.apply()` with a lambda function to square each value.

In [17]:
a = pd.Series([10, 15, 20, 25])
a
b = a.apply(lambda x: x**2)
print(b)

0    10
1    15
2    20
3    25
dtype: int64

0    100
1    225
2    400
3    625
dtype: int64

### Q:
Create a Series `[1, 2, None, 4, 5]`. Check if the Series contains any missing values using `.isna()` and `.any()`.

In [18]:
a = pd.Series([1, 2, None, 4, 5])
a
print(a.isna())
print(a.isna().any())

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

0    False
1    False
2     True
3    False
4    False
dtype: bool
True

### Q:
Create a Series `[2, 4, 6, 8]`. Multiply each value by `5`.

In [19]:
a = pd.Series([2, 4, 6, 8])
b = a * 5
print(b)

0    10
1    20
2    30
3    40
dtype: int64

### Q:
Create two Series `[1, 2, 3]` and `[4, 5, 6]`. Add them together.

In [20]:
a = pd.Series([1, 2, 3])
b = pd.Series([4, 5, 6])
c = a + b
print(c)

0    5
1    7
2    9
dtype: int64

### Q:
Create a Series `[10, 20, 30, 40, 50]`. Filter values that are divisible by `20` and greater than `10`.

In [21]:
a = pd.Series([10, 20, 30, 40, 50])
b = a[(a % 20 == 0) & (a > 10)]
print(b)

1    20
3    40
dtype: int64

### Q:
Create a Series `[100, 200, 300, 400]` with custom indices `['a', 'b', 'c', 'd']`. Access the value at index `'c'` using `.loc`.

In [22]:
a = pd.Series([100, 200, 300, 400], index=['a', 'b', 'c', 'd'])
print(a)
print(a.loc['c'])

a    100
b    200
c    300
d    400
dtype: int64
300

### Q:
Create a Series `[None, 5, 10, None, 20]`. Use `.notna()` to filter and display non-missing values.

In [23]:
a = pd.Series([None, 5, 10, None, 20])
print(a[a.notna()])

1     5.0
2    10.0
4    20.0
dtype: float64

### Q:
Create a Series `[2, 4, 6, 8]`. Use `.apply()` with a lambda function to calculate the cube of each value.

In [24]:
a = pd.Series([2, 4, 6, 8])
b = a.apply(lambda x: x**3)
print(b)

0      8
1     64
2    216
3    512
dtype: int64

### Creation of Dataframes:

### Q:
What is a DataFrame? Write its key features and applications.

- A DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure 
- with labeled axes (rows and columns) in Pandas. 
- It is similar to a spreadsheet or SQL table.

### Q:
Create a Series from a NumPy array and perform mean, median, mode, variance, and standard deviation on the array.

In [ ]:

a = np.array([10, 20, 20, 30, 40, 50])

# Convert NumPy array to Pandas Series
b = pd.Series(a)
print(b)

In [ ]:

# Mean
c = b.mean()
print(c)

# Median
d = b.median()
print(d)

# Mode
e = b.mode()[0]  # mode() returns a Series
print(e)

# Variance
f = b.var()
print(f)

# Standard Deviation
g = b.std()
print(g)

### Q:
1. Create a Pandas DataFrame with the following data:  

```python
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 75000, 90000]
}

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 75000, 90000]
}

In [ ]:
df = pd.DataFrame(data)
print(df)

In [ ]:
print(df['Name'])

In [ ]:
print(df.head(2))

In [ ]:
c = df.sort_values(by='Age', ascending=False)
print(c)

In [ ]:
df.to_csv('employees.csv', index=False)
print("\nDataFrame saved to 'employees.csv'.")

In [ ]:
df['EmpID'] = [101, 102, 103, 104]
df.set_index('EmpID', inplace=True)
print(df)

### Q:
1. Print the details of the person with the highest and lowest salary from the DataFrame.  
2. Calculate and print the average age and salary.  
3. Select and print the rows where Age is less than 35 and Salary is greater than 60000.

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 75000, 90000],
    'EmpID': [101, 102, 103, 104]
}

In [ ]:
df = pd.DataFrame(data).set_index('EmpID')

In [ ]:
print(df)

In [ ]:
highest_salary = df[df['Salary'] == df['Salary'].max()]
lowest_salary = df[df['Salary'] == df['Salary'].min()]

print(highest_salary)
print(lowest_salary)

In [ ]:
average_age = df['Age'].mean()
average_salary = df['Salary'].mean()
print(average_age)
print(average_salary)

In [ ]:
a = df[(df['Age'] < 35) & (df['Salary'] > 60000)]
print(a)

### Q:
Create a Pandas DataFrame from the following dictionary:

```python
data = {
    'City': ['New York', 'London', 'Tokyo', 'Paris'],
    'Population': [8398748, 8982256, 37435191, 2140526],
    'Area_km2': [468.9, 1572, 2191, 105.4]
}

In [ ]:
data = {
    'City': ['New York', 'London', 'Tokyo', 'Paris'],
    'Population': [8398748, 8982256, 37435191, 2140526],
    'Area_km2': [468.9, 1572, 2191, 105.4]
}
df = pd.DataFrame(data)
df

In [ ]:
df['Population_Density'] = df['Population'] / df['Area_km2']

In [ ]:
df

### Q:
1. Create a Pandas DataFrame with 100,000 rows using the following dictionary:

```python
large_dict = {
    'ID': np.arange(1, 100001),
    'Name': [f'Person_{i}' for i in range(1, 100001)],
    'Age': np.random.randint(18, 65, size=100000),
    'Salary': np.random.randint(40000, 120000, size=100000),
    'City': np.random.choice(['New York', 'London', 'Tokyo', 'Paris'], size=100000)
}

In [ ]:
large_dict = {
    'ID': np.arange(1, 100001),
    'Name': [f'Person_{i}' for i in range(1, 100001)],
    'Age': np.random.randint(18, 65, size=100000),
    'Salary': np.random.randint(40000, 120000, size=100000),
    'City': np.random.choice(['New York', 'London', 'Tokyo', 'Paris'], size=100000)
}

df_large = pd.DataFrame(large_dict)
df_large.head()

In [ ]:
df_large.to_csv('large_dataframe.csv', index=False)
df_large.to_excel('large_dataframe.xlsx', index=False)
print("\nDataFrame saved as 'large_dataframe.csv' and 'large_dataframe.xlsx'.")

In [ ]:
df_csv = pd.read_csv('large_dataframe.csv')
df_excel = pd.read_excel('large_dataframe.xlsx')

df_csv.head()
df_excel.head()

### Q:
1. Display information about the DataFrame.  
2. Show the last ten rows of the DataFrame.  
3. Get statistical information about the numeric columns.

In [ ]:
print("DataFrame Info:\n")
df_large.info()

In [ ]:
df_large.tail(10)

In [ ]:
df_large.describe()

### Q:
1. Create a Pandas DataFrame with columns `'City'`, `'Temperature'`, and `'Humidity'` containing the following data:

| City         | Temperature | Humidity |
|--------------|-------------|----------|
| New York     | 75          | 60       |
| Chicago      | 68          | 55       |
| Los Angeles  | 85          | 45       |
| Miami        | 80          | 70       |

2. Display the rows where the Temperature is above 70.  
3. Display the rows where the Humidity is below 60.  
4. Display the city with Temperature 68 and Humidity 55.

In [ ]:
data = {
    'City': ['New York', 'Chicago', 'Los Angeles', 'Miami'],
    'Temperature': [75, 68, 85, 80],
    'Humidity': [60, 55, 45, 70]
}
df = pd.DataFrame(data)
df

In [ ]:
temp_above_70 = df[df['Temperature'] > 70]
temp_above_70

In [ ]:
humidity_below_60 = df[df['Humidity'] < 60]
humidity_below_60

In [ ]:
specific_city = df[(df['Temperature'] == 68) & (df['Humidity'] == 55)]
specific_city

### Q:
1. Create a Pandas DataFrame with the following data:

```python
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'EmpID': [100, 103, 105, 102],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 75000, 90000]
}

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'EmpID': [100, 103, 105, 102],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 75000, 90000]
}
df = pd.DataFrame(data)
df

In [ ]:
sorted_df = df.sort_values(by='Age', ascending=False)
sorted_df

In [ ]:
df.set_index('EmpID', inplace=True)
df.to_csv('employees.csv')
df

In [ ]:
df['Category'] = ['A', 'B', 'C', 'A']
df

In [ ]:
unique_categories = df['Category'].unique()
print(unique_categories)

In [ ]:
high_salary = df[df['Salary'] > 60000]
high_salary

### Q:
Create a Pandas DataFrame with columns `'City'`, `'Population'`, and `'Area'` containing the following data:

| City         | Population | Area  |
|--------------|------------|-------|
| New York     | 8398748    | 468.9 |
| Chicago      | 2716000    | 227.6 |
| Los Angeles  | 3976322    | 1213.9|
| Houston      | 2328066    | 599.6 |

Sort the DataFrame based on `'Population'` in descending order and display it.

In [ ]:
data = {
    'City': ['New York', 'Chicago', 'Los Angeles', 'Houston'],
    'Population': [8398748, 2716000, 3976322, 2328066],
    'Area': [468.9, 227.6, 1213.9, 599.6]
}
df = pd.DataFrame(data)
df

In [ ]:
sorted_df = df.sort_values(by='Population', ascending=False)
sorted_df

### Q:
Create a Pandas DataFrame with columns `'Category'`, `'Price'`, and `'Quantity'` containing the following data:

| Category     | Price | Quantity |
|-------------|-------|----------|
| Electronics | 500   | 10       |
| Clothing    | 50    | 25       |
| Electronics | 800   | 5        |
| Clothing    | 30    | 30       |

1. Create a `'Total value'` column and calculate the total value for each row by multiplying `'Price'` and `'Quantity'`.  
2. Display the DataFrame.

In [ ]:
data = {
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
    'Price': [500, 50, 800, 30],
    'Quantity': [10, 25, 5, 30]
}
df = pd.DataFrame(data)
df

In [ ]:
df['Total value'] = df['Price'] * df['Quantity']

In [ ]:
df

### Pandas GroupBy and Cross Tab:


2. Display the first 5 rows of the DataFrame using `head()`.  
3. Display the unique values in the `Gender` column.

In [ ]:
file_path = r"C:\Users\kisho\OneDrive\Desktop\All semesters\Innomatics #405\2_EDA\Dataset Folder\loandata.csv"
df = pd.read_csv(file_path)
df

In [ ]:
print("First 5 rows of the DataFrame:\n")
df.head()

In [ ]:
print("\nUnique values in the Gender column:\n")
df['Gender'].unique()

### Q:
1. Group the DataFrame by the `Gender` column and calculate the mean of `ApplicantIncome` for each gender using `groupby()`.  
2. Calculate the minimum `LoanAmount` for each `Education` category using `groupby()`.

In [ ]:
file_path = r"C:\Users\kisho\OneDrive\Desktop\All semesters\Innomatics #405\2_EDA\Dataset Folder\loandata.csv"
df = pd.read_csv(file_path)
df

In [ ]:
mean_income_gender = df.groupby('Gender')['ApplicantIncome'].mean()
mean_income_gender

In [ ]:
min_loan_education = df.groupby('Education')['LoanAmount'].min()
min_loan_education

### Q:
1. Group the DataFrame by both `Gender` and `Married` columns, and calculate the maximum `LoanAmount` and mean `ApplicantIncome` using `agg()`.  
2. Calculate the count, variance, standard deviation, minimum, maximum, and non-zero count of `LoanAmount` for each `Property_Area` using `.agg([np.var, np.max, np.std, np.min, np.max, np.count_nonzero])`.

In [ ]:
group_gender_married = df.groupby(['Gender', 'Married']).agg({
    'LoanAmount': 'max',
    'ApplicantIncome': 'mean'
})
group_gender_married

In [ ]:
stats_property_area = df.groupby('Property_Area')['LoanAmount'].agg([
    np.var,
    np.std,
    np.min,
    np.max,
    np.count_nonzero
])
stats_property_area

### Q:
1. Sort the DataFrame by `LoanAmount` in descending order.  
2. Find the number of applicants with different `Loan_Status` values.  
3. Create a cross-tabulation of `Gender` and `Loan_Status` to see the count of loan approvals based on gender using `crosstab()`.

In [ ]:
sorted_df = df.sort_values(by='LoanAmount', ascending=False)
sorted_df.head()

In [ ]:
loan_status_counts = df['Loan_Status'].value_counts()
loan_status_counts

In [ ]:
gender_loan_crosstab = pd.crosstab(df['Gender'], df['Loan_Status'])
gender_loan_crosstab

### Q:
1. Create a pivot table that shows the average `LoanAmount` for each combination of `Education` and `Property_Area`.  
2. Group the data by `Credit_History` and `Loan_Status` and calculate the mean, max, and min of `ApplicantIncome` using `groupby()` and `.agg()`.  
3. Sort the DataFrame by `ApplicantIncome` in ascending order, then by `LoanAmount` in descending order using `sort_values()`.  
4. Create a pivot table to calculate the sum of `LoanAmount` for each `Self_Employed` status, grouped by `Gender`.

In [ ]:
pivot_loan = pd.pivot_table(df, values='LoanAmount', index='Education', columns='Property_Area', aggfunc='mean')
pivot_loan

In [ ]:
grouped_income = df.groupby(['Credit_History', 'Loan_Status'])['ApplicantIncome'].agg(['mean', 'max', 'min'])
grouped_income

In [ ]:
sorted_df = df.sort_values(by=['ApplicantIncome', 'LoanAmount'], ascending=[True, False])
sorted_df.head()

In [ ]:
pivot_self_employed = pd.pivot_table(df, values='LoanAmount', index='Self_Employed', columns='Gender', aggfunc='sum')
pivot_self_employed

### Pandas Joins:

### Q:
1. Perform an **inner join** on `df1` and `df2` using the common column `ID` and display the result.  
2. Perform a **left join** on `left_df` and `right_df` using the common column `ID` and display the result.  
3. Perform a **cross join** on `df7` and `df8` and display the result.

In [ ]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

inner_join_df = pd.merge(df1, df2, on='ID', how='inner')
inner_join_df

In [ ]:
left_df = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
right_df = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})

left_join_df = pd.merge(left_df, right_df, on='ID', how='left')
left_join_df

In [ ]:
df7 = pd.DataFrame({'Color': ['Red', 'Green', 'Blue']})
df8 = pd.DataFrame({'Size': ['Small', 'Medium', 'Large']})

cross_join_df = df7.merge(df8, how='cross')
cross_join_df

### Q:
1. Perform an **outer join** on `df3` and `df4` using the common column `ID` and display the result.  
2. Perform a **right join** on `df5` and `df6` using the common column `ID` and display the result.

In [ ]:
df3 = pd.DataFrame({'ID': [1, 2, 3], 'City': ['New York', 'San Francisco', 'Los Angeles']})
df4 = pd.DataFrame({'ID': [2, 3, 4], 'Population': [8500000, 880000, 4000000]})

outer_join_df = pd.merge(df3, df4, on='ID', how='outer')
outer_join_df

In [ ]:
df5 = pd.DataFrame({'ID': [1, 2, 3], 'Product': ['Laptop', 'Mouse', 'Keyboard']})
df6 = pd.DataFrame({'ID': [2, 3, 4], 'Price': [1200, 30, 50]})

right_join_df = pd.merge(df5, df6, on='ID', how='right')
right_join_df

### Pivot Tables:

### Q:
1. Calculate the total sales for each product.  
2. Find the average sales for each region.  
3. Create a pivot table to display total sales for each month and product.

In [29]:
sales_data = {
    'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South'],
    'Month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb'],
    'Sales': [100, 150, 120, 130, 80, 110]
}

df = pd.DataFrame(sales_data)
df

  Product Region Month  Sales
0       A  North   Jan    100
1       B  South   Feb    150
2       A  North   Jan    120
3       B  South   Feb    130
4       A  North   Jan     80
5       B  South   Feb    110

In [32]:
a = df.groupby('Product')[['Sales']].sum()
a

         Sales
Product
A          300
B          390

In [33]:
b = df.groupby('Region')[['Sales']].mean()
b

        Sales
Region
North   100.0
South   130.0

In [34]:
c = pd.pivot_table(df, values='Sales', index='Month', columns='Product', aggfunc='sum')
c

Product      A      B
Month
Feb        NaN  390.0
Jan      300.0    NaN

### Q:
1. Calculate the total tasks completed by each employee.  
2. Find the average tasks completed for each department.  
3. Create a pivot table to display the total tasks completed for each month and department.

In [35]:
employee_data = {
    'EmployeeID': [101, 102, 103, 101, 102, 103],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR', 'IT'],
    'Month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb'],
    'Tasks_Completed': [20, 30, 25, 35, 18, 28]
}

df = pd.DataFrame(employee_data)
df

   EmployeeID Department Month  Tasks_Completed
0         101         HR   Jan               20
1         102         IT   Feb               30
2         103         HR   Jan               25
3         101         IT   Feb               35
4         102         HR   Jan               18
5         103         IT   Feb               28

In [37]:
a = df.groupby('EmployeeID')[['Tasks_Completed']].sum()
a

            Tasks_Completed
EmployeeID
101                      55
102                      48
103                      53

In [38]:
b = df.groupby('Department')[['Tasks_Completed']].mean()
b

            Tasks_Completed
Department
HR                     21.0
IT                     31.0

In [39]:
c = pd.pivot_table(df, values='Tasks_Completed', index='Month', columns='Department', aggfunc='sum')
c

Department    HR    IT
Month
Feb          NaN  93.0
Jan         63.0   NaN

### Q:
1. Create project stages based on progress: 'Early', 'Mid', 'Late'.  
2. Find the average progress for each department.  
3. Create a pivot table to display the total progress for each month and department.

In [40]:
project_data = {
    'ProjectID': [101, 102, 103, 104, 105],
    'Department': ['HR', 'IT', 'HR', 'IT', 'HR'],
    'Month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan'],
    'Progress': [80, 60, 90, 75, 85]
}

df = pd.DataFrame(project_data)
df

   ProjectID Department Month  Progress
0        101         HR   Jan        80
1        102         IT   Feb        60
2        103         HR   Jan        90
3        104         IT   Feb        75
4        105         HR   Jan        85

In [41]:
def stage(progress):
    if progress < 70:
        return 'Early'
    elif 70 <= progress < 85:
        return 'Mid'
    else:
        return 'Late'

df['Stage'] = df['Progress'].apply(stage)
df

   ProjectID Department Month  Progress  Stage
0        101         HR   Jan        80    Mid
1        102         IT   Feb        60  Early
2        103         HR   Jan        90   Late
3        104         IT   Feb        75    Mid
4        105         HR   Jan        85   Late

In [43]:
a = df.groupby('Department')[['Progress']].mean()
a

            Progress
Department
HR              85.0
IT              67.5

In [44]:
b = pd.pivot_table(df, values='Progress', index='Month', columns='Department', aggfunc='sum')
b

Department     HR     IT
Month
Feb           NaN  135.0
Jan         255.0    NaN